<?php
// +----------------------------------------------------------------------
// | TvcPHP PHP微型框架，一个用于快速构建交互DEMO系统的微型框架。
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://www.ccbox.net All rights reserved.
// +----------------------------------------------------------------------
// | Author: 达达 <ccbox_net@163.com> <http://www.ccbox.net>
// +----------------------------------------------------------------------
// | Date Time: 16:21 2017-03-20
// | Title: 应用前置文件
// +----------------------------------------------------------------------

// 定义各种常用地址
function define_urls(){
	$return['home']		= U('','home','index',HOME);
	$return['demo'] 	= U('mt=ctl','','demo');
	
	return $return;
}

