<?php
// +----------------------------------------------------------------------
// | TvcPHP PHP微型框架，一个用于快速构建交互DEMO系统的微型框架。
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://www.ccbox.net All rights reserved.
// +----------------------------------------------------------------------
// | Author: 达达 <ccbox_net@163.com> <http://www.ccbox.net>
// +----------------------------------------------------------------------
// | Date Time: 16:21 2017-03-20
// | Title: 应用配置文件
// +----------------------------------------------------------------------

// 定义前端用地址
// define('PUBLIC_APP',APP.'Public/');		// 当前应用公共文件
$cfg['core']['DEBUG'] = true;						// 调试模式
$cfg['view']['PUBLIC_APP'] = APP.'Public/';			// 当前应用公共文件

$cfg['core']['VU'] = APP.'v/unit/';					// 定义视图模块目录


