<?php
// +----------------------------------------------------------------------
// | TvcPHP PHP微型框架，一个用于快速构建交互DEMO系统的微型框架。
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://www.ccbox.net All rights reserved.
// +----------------------------------------------------------------------
// | Author: 达达 <ccbox_net@163.com> <http://www.ccbox.net>
// +----------------------------------------------------------------------
// | Date Time: 16:21 2017-03-20
// | Title: 控制器文件
// +----------------------------------------------------------------------

function index_act(){
	$v['title'] = 'TvcPHP：PHP微型框架，一个用于快速构建交互DEMO系统的微型框架。';
	$v['info'] = '这是首页，妥妥的。';
	$v['URL'] = define_urls();
	show('index',$v);
}

function demo_act(){
	$v['title'] = '这是DEMO页面，因为用的同样的模板，所以长得跟首页一样。';
	$mt = get_url_data('mt');
	if($mt == 'ctl'){
		$v['info'] = '这个页面链接是从控制器中生成的';
	}elseif($mt == 'tpl'){
		$v['info'] = '这个页面链接是从模板U函数中生成的';
	}else{
		$v['info'] = '这个页面链接我也不知道是从哪里生成的';
	}
	$v['URL'] = define_urls();
	//dump($v);
	show('index',$v);
}

function error_404_act(){
	$v['title'] = '页面没找到';
	$v['info'] = '非常的抱歉，你访问的页面没找到。';
	show('error_404',$v);
	
}
